#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on ../modules/shared/lambda-function/main.tf line 14, in locals:
  14:   data.aws_lambda_function.existing_function[0].source_code_hash)

The attribute "source_code_hash" is deprecated. Refer to the provider
documentation for details.

(and 35 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### TFLint 🖌`success`

<details><summary>TFLint Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 1s [id=-]
module.integrated_data_vpc_dev.data.aws_availability_zones.available: Reading...
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bods-avl-data-endpoint-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.aws_s3_bucket.integrated_data_bods_txc_zipped_bucket: Refreshing state... [id=integrated-data-bods-txc-zipped-dev]
module.integrated_data_gtfs_rt_pipeline.aws_s3_bucket.integrated_data_gtfs_rt_bucket: Refreshing state... [id=integrated-data-gtfs-rt-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket.integrated_data_tnds_txc_zipped_bucket: Refreshing state... [id=integrated-data-tnds-txc-zipped-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-tnds-txc-retriever-role-dev]
module.integrated_data_naptan_pipeline.aws_s3_bucket.integrated_data_naptan_s3_bucket: Refreshing state... [id=integrated-data-naptan-stops-dev]
module.integrated_data_avl_pipeline.aws_s3_bucket.integrated_data_avl_siri_vm_bucket: Refreshing state... [id=integrated-data-avl-generated-siri-vm-dev]
module.integrated_data_nptg_pipeline.aws_s3_bucket.integrated_data_nptg_s3_bucket: Refreshing state... [id=integrated-data-nptg-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_vpc_dev.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-2]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-nptg-retriever-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-validate-dev]
module.integrated_data_fares_pipeline.aws_s3_bucket.integrated_data_bods_fares_bucket: Refreshing state... [id=integrated-data-bods-fares-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-feed-validator-dev]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-gtfs-downloader-role-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-bods-fares-retriever-dev]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_gtfs_rt_pipeline.data.aws_caller_identity.current: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-mock-data-producer-send-data-dev]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-txc-processor-role-dev]
module.integrated_data_gtfs_rt_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_avl_validation_error_table.aws_dynamodb_table.table: Refreshing state... [id=integrated-data-avl-validation-error-table-dev]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-gtfs-rt-downloader-2-dev]
module.integrated_data_noc_pipeline.aws_s3_bucket.integrated_data_noc_bucket: Refreshing state... [id=integrated-data-noc-dev]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-unsubscriber-dev]
module.integrated_data_fares_pipeline.aws_s3_bucket.integrated_data_bods_fares_zipped_bucket: Refreshing state... [id=integrated-data-bods-fares-zipped-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_subscribe.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-mock-data-producer-subscribe-role-dev]
module.integrated_data_timetables_sfn.data.aws_caller_identity.current: Reading...
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-nptg-uploader-role-dev]
module.integrated_data_vpc_dev.aws_vpc.integrated_data_vpc: Refreshing state... [id=vpc-05214265b6f4e3e89]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-update-endpoint-role-dev]
module.integrated_data_timetables_sfn.data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_avl_pipeline.aws_secretsmanager_secret.tfl_api_keys_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:tfl_api_keys-MPxj8p]
module.integrated_data_internal_api.data.aws_caller_identity.current: Reading...
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-feed-validator-role-dev]
module.integrated_data_internal_api.data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bank-holidays-retriever-role-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-noc-retriever-role-dev]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-noc-retriever-dev]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-gtfs-rt-downloader-2-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-subscriber-role-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-txc-unzipper-role-dev]
module.integrated_data_timetables_sfn.data.aws_region.current: Reading...
module.integrated_data_timetables_sfn.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-bods-txc-retriever-dev]
module.integrated_data_bastion_host.data.aws_iam_policy_document.bastion_instance_trust_policy: Reading...
module.integrated_data_bastion_host.data.aws_iam_policy_document.bastion_instance_trust_policy: Read complete after 0s [id=2851119427]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-update-endpoint-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_api.integrated_data_avl_producer_api: Refreshing state... [id=f059ooqui7]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-db-migrator-migrate-role-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-noc-processor-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-processor-role-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-gtfs-region-retriever-dev]
module.integrated_data_vpc_dev.aws_eip.integrated_data_nat_gateway_eip["0"]: Refreshing state... [id=eipalloc-0dddff076b95e751e]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-role-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/211125357119/integrated-data-avl-queue-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-processor-dev]
module.integrated_data_route53.aws_route53_zone.integrated_data_public_hosted_zone: Refreshing state... [id=Z0720763YKRZYOYAPS9Q]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-db-migrator-migrate-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket.integrated_data_tnds_txc_bucket: Refreshing state... [id=integrated-data-tnds-txc-dev]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bods-txc-retriever-role-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-naptan-uploader-dev]
module.integrated_data_avl_pipeline.data.aws_caller_identity.current: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-mock-producer-send-heartbeat-role-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-db-migrator-rollback-role-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bods-fares-retriever-role-dev]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.aws_s3_bucket.integrated_data_bods_txc_bucket: Refreshing state... [id=integrated-data-bods-txc-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-nptg-retriever-role-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-tfl-location-retriever-dev]
module.integrated_data_cloudfront.aws_cloudfront_origin_access_control.avl_siri_vm_downloader_access_control: Refreshing state... [id=E14TNJUQ7G8CLP]
module.integrated_data_bank_holidays_pipeline.aws_s3_bucket.integrated_data_bank_holidays_bucket: Refreshing state... [id=integrated-data-bank-holidays-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-bods-fares-unzipper-dev]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.aws_secretsmanager_secret.avl_consumer_api_key_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:avl_consumer_api_key-hgyMft]
module.integrated_data_avl_consumer_api.aws_apigatewayv2_api.integrated_data_avl_consumer_api: Refreshing state... [id=1k3iaeyna1]
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-bods-disruptions-retriever-dev]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-table-renamer-role-dev]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-table-renamer-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket.integrated_data_gtfs_timetables_bucket: Refreshing state... [id=integrated-data-gtfs-timetables-dev]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-validate-role-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-nptg-uploader-dev]
module.integrated_data_monitoring_dev.aws_sns_topic.integrated_data_ok_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-ok-topic-dev]
module.integrated_data_aurora_db_dev.aws_s3_bucket.aurora_s3_output_bucket: Refreshing state... [id=integrated-data-aurora-output-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-tfl-line-id-retriever-dev]
module.integrated_data_gtfs_rt_pipeline.aws_ecs_cluster.gtfs_rt_ecs_cluster[0]: Refreshing state... [id=arn:aws:ecs:eu-west-2:211125357119:cluster/integrated-data-gtfs-rt-ecs-cluster-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_subscribe.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-txc-unzipper-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bods-fares-unzipper-role-dev]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_subscribe.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-mock-data-producer-subscribe-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_disruptions_pipeline.aws_s3_bucket.integrated_data_bods_disruptions_zipped_bucket: Refreshing state... [id=integrated-data-bods-disruptions-zipped-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-tnds-txc-retriever-dev]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-unsubscriber-role-dev]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-bods-disruptions-retriever-role-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-gtfs-region-retriever-role-dev]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-gtfs-timetables-generator-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-naptan-uploader-role-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-naptan-retriever-dev]
module.integrated_data_gtfs_api.aws_cloudwatch_log_group.gtfs_log_group: Refreshing state... [id=integrated-data-gtfs-api-log-group-dev]
module.integrated_data_aurora_db_dev.data.aws_caller_identity.current: Reading...
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-db-cleardown-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_gtfs_api.aws_apigatewayv2_api.integrated_data_gtfs_api: Refreshing state... [id=h3mpecbs44]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_apigatewayv2_api.integrated_data_mock_avl_producer_api[0]: Refreshing state... [id=wrygmxhnph]
module.integrated_data_aurora_db_dev.data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_internal_api.data.aws_region.current: Reading...
module.integrated_data_internal_api.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.integrated_data_monitoring_dev.aws_sns_topic.integrated_data_alarm_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-alarm-topic-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_s3_bucket.bucket: Refreshing state... [id=integrated-data-avl-raw-siri-vm-dev]
module.integrated_data_avl_subscription_table.aws_dynamodb_table.table: Refreshing state... [id=integrated-data-avl-subscription-table-dev]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-mock-producer-send-heartbeat-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/211125357119/integrated-data-avl-dlq-dev]
module.integrated_data_bastion_host.data.aws_ami.amzn_linux_2023_ami: Reading...
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-mock-data-producer-send-data-role-dev]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-siri-vm-downloader-role-dev]
module.integrated_data_avl_data_producer_api.aws_secretsmanager_secret.avl_producer_api_key_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:avl_producer_api_key-SDdlcj]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-bank-holidays-retriever-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-subscriptions-role-dev]
module.integrated_data_txc_pipeline.aws_secretsmanager_secret.tnds_ftp_credentials_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:tnds_ftp-YkX9pv]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-noc-processor-role-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-naptan-retriever-role-dev]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-txc-processor-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-db-cleardown-role-dev]
module.integrated_data_bastion_host.data.aws_ami.amzn_linux_2023_ami: Read complete after 1s [id=ami-046d5130831576bbb]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-avl-tfl-line-id-retriever-role-dev]
module.integrated_data_avl_pipeline.aws_ecs_cluster.avl_ecs_cluster[0]: Refreshing state... [id=arn:aws:ecs:eu-west-2:211125357119:cluster/integrated-data-siri-vm-generator-ecs-cluster-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.data.aws_lambda_function.existing_function[0]: Reading...
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_iam_role.lambda_role: Refreshing state... [id=integrated-data-gtfs-timetables-generator-role-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-tnds-txc-retriever-role-dev-20240311111128045600000002]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-gtfs-downloader-role-dev-20240328155147458500000003]
module.integrated_data_gtfs_rt_pipeline.aws_iam_policy.bods_avl_processor_ecs_execution_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-avl-processor-ecs-execution-policy-dev]
module.integrated_data_gtfs_rt_pipeline.aws_s3_bucket_versioning.integrated_data_gtfs_rt_bucket_versioning: Refreshing state... [id=integrated-data-gtfs-rt-dev]
module.integrated_data_gtfs_rt_pipeline.aws_s3_bucket_public_access_block.integrated_data_gtfs_rt_bucket_block_public_access: Refreshing state... [id=integrated-data-gtfs-rt-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket_public_access_block.integrated_data_tnds_txc_zipped_bucket_block_public_access: Refreshing state... [id=integrated-data-tnds-txc-zipped-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-avl-subscriber-dev]
module.integrated_data_avl_pipeline.aws_s3_bucket_public_access_block.integrated_data_avl_siri_vm_block_public: Refreshing state... [id=integrated-data-avl-generated-siri-vm-dev]
module.integrated_data_avl_pipeline.aws_s3_bucket_versioning.integrated_data_avl_siri_vm_bucket_versioning: Refreshing state... [id=integrated-data-avl-generated-siri-vm-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket_public_access_block.integrated_data_bods_txc_zipped_bucket_block_public_access: Refreshing state... [id=integrated-data-bods-txc-zipped-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.data.aws_lambda_function.existing_function[0]: Read complete after 1s [id=integrated-data-db-migrator-rollback-dev]
module.integrated_data_naptan_pipeline.aws_s3_bucket_versioning.integrated_data_naptan_s3_bucket_versioning: Refreshing state... [id=integrated-data-naptan-stops-dev]
module.integrated_data_naptan_pipeline.aws_s3_bucket_public_access_block.integrated_data_naptan_s3_bucket_block_public: Refreshing state... [id=integrated-data-naptan-stops-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_subscribe.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-mock-data-producer-subscribe-role-dev-20240621095846654700000004]
module.integrated_data_nptg_pipeline.aws_s3_bucket_versioning.integrated_data_nptg_s3_bucket_versioning: Refreshing state... [id=integrated-data-nptg-dev]
module.integrated_data_nptg_pipeline.aws_s3_bucket_public_access_block.integrated_data_nptg_s3_bucket_block_public: Refreshing state... [id=integrated-data-nptg-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-gtfs-downloader-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-feed-validator-role-dev-20240621095845526400000001]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bank-holidays-retriever-role-dev-20240422084349196600000001]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.data.aws_lambda_function.existing_function[0]: Read complete after 0s [id=integrated-data-avl-subscriptions-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-noc-retriever-role-dev-20240405080735180000000001]
module.integrated_data_avl_pipeline.aws_secretsmanager_secret_version.tfl_api_keys_secret_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:tfl_api_keys-MPxj8p|terraform-20240711125944293700000004]
module.integrated_data_fares_pipeline.aws_s3_bucket_public_access_block.integrated_data_bods_fares_bucket_block_public_access: Refreshing state... [id=integrated-data-bods-fares-dev]
module.integrated_data_timetables_sfn.aws_iam_role.integrated_data_timetables_sfn_role: Refreshing state... [id=integrated-data-timetables-sfn-role-dev]
module.integrated_data_bastion_host.aws_iam_role.integrated_data_bastion_role: Refreshing state... [id=integrated-data-bastion-role-dev]
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-txc-unzipper-role-dev-20240429092442858900000002]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_stage.integrated_data_avl_producer_api_stage: Refreshing state... [id=$default]
module.integrated_data_avl_pipeline.aws_iam_policy.siri_vm_generator_ecs_execution_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-siri-vm-generator-ecs-execution-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bods-txc-retriever-role-dev-20240305190141727400000003]
module.integrated_data_noc_pipeline.aws_s3_bucket_public_access_block.integrated_data_noc_bucket_block_public_access: Refreshing state... [id=integrated-data-noc-dev]
module.integrated_data_noc_pipeline.aws_s3_bucket_versioning.integrated_data_noc_bucket_versioning: Refreshing state... [id=integrated-data-noc-dev]
module.integrated_data_vpc_dev.aws_route_table.integrated_data_db_subnet_route_table: Refreshing state... [id=rtb-087aa59654a436874]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_public_subnet["0"]: Refreshing state... [id=subnet-02f159988128848ea]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_public_subnet["1"]: Refreshing state... [id=subnet-04e9551b4c92d19af]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_public_subnet["2"]: Refreshing state... [id=subnet-0545f893c50669a5a]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_db_subnet["0"]: Refreshing state... [id=subnet-0ad1da09564e504bd]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_db_subnet["1"]: Refreshing state... [id=subnet-05503302a0aa879c4]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_db_subnet["2"]: Refreshing state... [id=subnet-0fc7737df929fa95f]
module.integrated_data_vpc_dev.aws_internet_gateway.integrated_data_igw: Refreshing state... [id=igw-017a4980fe56a85f4]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_private_subnet["2"]: Refreshing state... [id=subnet-0086238f6dd09c42e]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_private_subnet["1"]: Refreshing state... [id=subnet-0957d8d504826c2fd]
module.integrated_data_vpc_dev.aws_subnet.integrated_data_private_subnet["0"]: Refreshing state... [id=subnet-0653d66c37f1fae4c]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-mock-producer-send-heartbeat-role-dev-20240621095845904600000002]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bods-fares-retriever-role-dev-20240521080654081800000001]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-nptg-retriever-role-dev-20240415144439777600000001]
module.integrated_data_fares_pipeline.aws_s3_bucket_public_access_block.integrated_data_bods_fares_zipped_bucket_block_public_access: Refreshing state... [id=integrated-data-bods-fares-zipped-dev]
module.integrated_data_fares_pipeline.aws_s3_bucket_versioning.integrated_data_bods_fares_zipped_bucket_versioning: Refreshing state... [id=integrated-data-bods-fares-zipped-dev]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.aws_secretsmanager_secret_version.avl_consumer_api_key_secret_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:avl_consumer_api_key-hgyMft|terraform-20240711102949550800000006]
module.integrated_data_avl_consumer_api.aws_apigatewayv2_deployment.integrated_data_avl_consumer_api_deployment: Refreshing state... [id=93kmld]
module.integrated_data_avl_consumer_api.aws_apigatewayv2_stage.integrated_data_avl_consumer_api_stage: Refreshing state... [id=$default]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-validate-role-dev-20240716105552609700000002]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bods-fares-unzipper-role-dev-20240528090154019300000001]
module.integrated_data_monitoring_dev.data.aws_iam_policy_document.sns_topic_policy: Reading...
module.integrated_data_monitoring_dev.data.aws_iam_policy_document.sns_topic_policy: Read complete after 0s [id=2042790745]
module.integrated_data_monitoring_dev.aws_sns_topic_subscription.integrated_data_ok_subscription[0]: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-ok-topic-dev:9a376b0e-8b4b-4a90-a243-2f908cc85400]
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bods-disruptions-retriever-role-dev-20240617141119718900000001]
module.integrated_data_txc_pipeline.aws_s3_bucket_public_access_block.integrated_data_tnds_txc_bucket_block_public_access: Refreshing state... [id=integrated-data-tnds-txc-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-gtfs-region-retriever-role-dev-20240514080053472600000001]
module.integrated_data_aurora_db_dev.aws_iam_role.rds_enhanced_monitoring_role: Refreshing state... [id=integrated-data-rds-enhanced-monitoring-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_apigatewayv2_stage.integrated_data_mock_avl_producer_api_stage[0]: Refreshing state... [id=$default]
module.integrated_data_monitoring_dev.aws_sns_topic_subscription.integrated_data_alarm_subscription[0]: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-alarm-topic-dev:6992e1df-88fb-4433-8b38-81a3191dbd9f]
module.integrated_data_gtfs_api.aws_apigatewayv2_stage.integrated_data_gtfs_api_stage: Refreshing state... [id=$default]
module.integrated_data_txc_pipeline.aws_s3_bucket_public_access_block.integrated_data_bods_txc_bucket_block_public_access: Refreshing state... [id=integrated-data-bods-txc-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_sqs_queue_redrive_policy.queue_redrive_policy[0]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/211125357119/integrated-data-avl-queue-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_sqs_queue_redrive_allow_policy.sqs_redrive_allow_policy[0]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/211125357119/integrated-data-avl-dlq-dev]
module.integrated_data_bank_holidays_pipeline.aws_s3_bucket_versioning.integrated_data_bank_holidays_bucket_versioning: Refreshing state... [id=integrated-data-bank-holidays-dev]
module.integrated_data_bank_holidays_pipeline.aws_s3_bucket_public_access_block.integrated_data_bank_holidays_bucket_block_public_access: Refreshing state... [id=integrated-data-bank-holidays-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket_public_access_block.integrated_data_gtfs_timetables_bucket_block_public_access: Refreshing state... [id=integrated-data-gtfs-timetables-dev]
module.integrated_data_txc_pipeline.aws_s3_bucket_versioning.integrated_data_gtfs_timetables_bucket_versioning: Refreshing state... [id=integrated-data-gtfs-timetables-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-mock-data-producer-send-data-role-dev-20240621095846282500000003]
module.integrated_data_aurora_db_dev.aws_s3_bucket_public_access_block.aurora_s3_output_bucket_block_public: Refreshing state... [id=integrated-data-aurora-output-dev]
module.integrated_data_aurora_db_dev.aws_iam_policy.rds_s3_export_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-rds-s3-export-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-subscriptions-role-dev-20240621095901985100000005]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-naptan-retriever-role-dev-20240305190141696700000001]
module.integrated_data_avl_data_producer_api.aws_secretsmanager_secret_version.avl_producer_api_key_secret_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:avl_producer_api_key-SDdlcj|terraform-20240711125942144500000003]
module.integrated_data_txc_pipeline.aws_secretsmanager_secret_version.tnds_ftp_credentials_secret_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:211125357119:secret:tnds_ftp-YkX9pv|terraform-20240711102949578200000007]
module.integrated_data_gtfs_rt_pipeline.aws_iam_role.bods_avl_processor_ecs_execution_role[0]: Refreshing state... [id=integrated-data-bods-avl-processor-ecs-execution-role-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-naptan-retriever-policy-dev]
module.integrated_data_disruptions_pipeline.aws_s3_bucket_versioning.integrated_data_bods_disruptions_zipped_bucket_versioning: Refreshing state... [id=integrated-data-bods-disruptions-zipped-dev]
module.integrated_data_disruptions_pipeline.aws_s3_bucket_public_access_block.integrated_data_bods_disruptions_zipped_bucket_block_public_access: Refreshing state... [id=integrated-data-bods-disruptions-zipped-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-nptg-retriever-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-nptg-retriever-policy-dev]
module.integrated_data_vpc_dev.aws_vpc_endpoint.integrated_data_s3_vpc_gateway_endpoint: Refreshing state... [id=vpce-05a216de26b9ebb92]
module.integrated_data_vpc_dev.aws_vpc_endpoint.integrated_data_dynamodb_vpc_gateway_endpoint: Refreshing state... [id=vpce-0a03ebd25b1741446]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-noc-retriever-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-noc-retriever-policy-dev]
module.integrated_data_bastion_host.aws_iam_instance_profile.integrated_data_bastion_instance_profile: Refreshing state... [id=integrated-data-bastion-instance-profile-dev]
module.integrated_data_avl_pipeline.aws_iam_role.siri_vm_generator_ecs_execution_role[0]: Refreshing state... [id=integrated-data-siri-vm-generator-ecs-execution-role-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_s3_bucket_notification.s3_bucket_sqs_notification: Refreshing state... [id=integrated-data-avl-raw-siri-vm-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.data.aws_iam_policy_document.sqs_queue_policy: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.data.aws_iam_policy_document.sqs_queue_policy: Read complete after 0s [id=2699038941]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_s3_bucket_public_access_block.s3_bucket_block_public: Refreshing state... [id=integrated-data-avl-raw-siri-vm-dev]
module.integrated_data_vpc_dev.aws_nat_gateway.integrated_data_nat_gateway["0"]: Refreshing state... [id=nat-074b0c40e38472c33]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_db_subnet_route_table_assoc["1"]: Refreshing state... [id=rtbassoc-0665104e24a9b5e49]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_db_subnet_route_table_assoc["2"]: Refreshing state... [id=rtbassoc-095705a041f254343]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_db_subnet_route_table_assoc["0"]: Refreshing state... [id=rtbassoc-06d7d09b31b104ed0]
module.integrated_data_vpc_dev.aws_route_table.integrated_data_public_subnet_route_table: Refreshing state... [id=rtb-008e50577c59731bd]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bods-fares-unzipper-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bods-fares-retriever-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-fares-retriever-policy-dev]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-fares-unzipper-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_subscribe.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-mock-data-producer-subscribe-dev]
module.integrated_data_monitoring_dev.aws_sns_topic_policy.integrated_data_ok_topic_policy: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-ok-topic-dev]
module.integrated_data_monitoring_dev.aws_sns_topic_policy.integrated_data_alarm_topic_policy: Refreshing state... [id=arn:aws:sns:eu-west-2:211125357119:integrated-data-monitoring-alarm-topic-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-naptan-retriever-dev]
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-txc-unzipper-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-txc-unzipper-dev]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-txc-retriever-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bods-txc-retriever-dev]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bank-holidays-retriever-policy-dev]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bank-holidays-retriever-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-tnds-txc-retriever-dev]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-tnds-txc-retriever-policy-dev]
module.integrated_data_aurora_db_dev.aws_iam_role.rds_s3_export_role: Refreshing state... [id=integrated-data-rds-s3-export-role-dev]
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bods-disruptions-retriever-dev]
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-disruptions-retriever-policy-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-naptan-retriever-role-dev-20240305190141731000000004]
module.integrated_data_acm.aws_acm_certificate.integrated_data_acm_certificate: Refreshing state... [id=arn:aws:acm:eu-west-2:211125357119:certificate/48e509d6-bfed-41d8-9c71-22f11e479468]
module.integrated_data_acm.aws_acm_certificate.integrated_data_cloudfront_acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:211125357119:certificate/50de9059-7347-43c0-b270-ee0f25edca56]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-nptg-retriever-role-dev-20240415144443291600000002]
module.integrated_data_noc_pipeline.module.integrated_data_noc_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-noc-retriever-role-dev-20240405080738293800000002]
module.integrated_data_bastion_host.aws_security_group.integrated_data_bastion_sg: Refreshing state... [id=sg-03c53106ab05eb84c]
module.integrated_data_avl_pipeline.aws_security_group.siri_vm_generator_sg[0]: Refreshing state... [id=sg-0a9a7b39a1dbbb22c]
module.integrated_data_route53.aws_route53_zone.integrated_data_private_hosted_zone: Refreshing state... [id=Z08492942LI9YDSUKYBS9]
module.integrated_data_gtfs_rt_pipeline.aws_security_group.bods_avl_processor_sg[0]: Refreshing state... [id=sg-0a5f6fe6cb7316e4f]
module.integrated_data_aurora_db_dev.aws_security_group.integrated_data_db_sg: Refreshing state... [id=sg-0f236375be9e8ba29]
module.integrated_data_aurora_db_dev.data.aws_vpc_endpoint.s3_endpoint: Reading...
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_sqs_queue_policy.sqs_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/211125357119/integrated-data-avl-queue-dev]
module.integrated_data_vpc_dev.aws_vpc_endpoint_route_table_association.integrated_data_dynamodb_vpc_gateway_endpoint_db_route_table_association: Refreshing state... [id=a-vpce-0a03ebd25b17414461449053856]
module.integrated_data_vpc_dev.aws_vpc_endpoint_route_table_association.integrated_data_s3_vpc_gateway_endpoint_db_route_table_association: Refreshing state... [id=a-vpce-05a216de26b9ebb921449053856]
module.integrated_data_vpc_dev.aws_route_table.integrated_data_private_subnet_route_table["0"]: Refreshing state... [id=rtb-0eea5e9620c22045f]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bods-fares-retriever-role-dev-20240521080715005900000002]
module.integrated_data_fares_pipeline.module.integrated_data_bods_fares_unzipper_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bods-fares-unzipper-role-dev-20240528090221651800000002]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_public_subnet_route_table_assoc["0"]: Refreshing state... [id=rtbassoc-08effd30f303f6087]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_public_subnet_route_table_assoc["1"]: Refreshing state... [id=rtbassoc-0f0548bc5b8d74450]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_public_subnet_route_table_assoc["2"]: Refreshing state... [id=rtbassoc-00796e830bc205007]
module.integrated_data_txc_pipeline.module.integrated_data_unzipper_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-txc-unzipper-role-dev-20240429092510683300000007]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-validate-dev]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-validate-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_bods_txc_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bods-txc-retriever-role-dev-20240305190141834500000006]
module.integrated_data_bank_holidays_pipeline.module.integrated_data_bank_holidays_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bank-holidays-retriever-role-dev-20240422084351437800000002]
module.integrated_data_txc_pipeline.module.integrated_data_tnds_txc_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-tnds-txc-retriever-role-dev-20240311111128484100000004]
module.integrated_data_disruptions_pipeline.module.integrated_data_bods_disruptions_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bods-disruptions-retriever-role-dev-20240617141151940600000002]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0637d3ace762c5082]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0e8ccefadd4801644]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0597dcead8894d0fa]
module.integrated_data_aurora_db_dev.data.aws_vpc_endpoint.s3_endpoint: Read complete after 1s [id=vpce-05a216de26b9ebb92]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-09501481b16c4b4d4]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0c63f8fb00f8634ae]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-04010e7eff60108ce]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0f8829b6843b3464e]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-09d4b7bc6d66dc26b]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-01bb2340ed5a7f033]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-077932145f37cd095]
module.integrated_data_bastion_host.aws_vpc_security_group_ingress_rule.integrated_data_bastion_sg_allow_ingress_from_vpc: Refreshing state... [id=sgr-061bc69ef98cc5235]
module.integrated_data_bastion_host.aws_vpc_security_group_egress_rule.integrated_data_bastion_sg_allow_all_egress_ipv4: Refreshing state... [id=sgr-079c5784ed7c9f28d]
module.integrated_data_bastion_host.aws_vpc_security_group_egress_rule.integrated_data_bastion_sg_allow_all_egress_ipv6: Refreshing state... [id=sgr-07ab1cd55fa47bc31]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-0a9c573cffacbe087]
module.integrated_data_bastion_host.aws_launch_template.integrated_data_bastion_launch_template: Refreshing state... [id=lt-01a579d78b59db9bc]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-089a9078d988f2af3]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-08d298659d110a52d]
module.integrated_data_avl_pipeline.aws_vpc_security_group_egress_rule.siri_vm_generator_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0c1d881a6b34e7f57]
module.integrated_data_avl_pipeline.aws_vpc_security_group_egress_rule.siri_vm_generator_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-07b3763b9bf66d09a]
module.integrated_data_aurora_db_dev.aws_db_subnet_group.rds_private_db_subnet: Refreshing state... [id=integrated-data-db-subnet-group-dev]
module.integrated_data_gtfs_rt_pipeline.aws_vpc_security_group_egress_rule.bods_avl_processor_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-095e29fcb403ab370]
module.integrated_data_gtfs_rt_pipeline.aws_vpc_security_group_egress_rule.bods_avl_processor_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0e52d9b9feb3bc1f3]
module.integrated_data_aurora_db_dev.aws_vpc_security_group_ingress_rule.integrated_data_db_sg_self_ingress: Refreshing state... [id=sgr-02e35557f612f04b2]
module.integrated_data_aurora_db_dev.aws_vpc_security_group_egress_rule.integrated_data_db_sg_self_egress: Refreshing state... [id=sgr-0531ec2ac4c682716]
module.integrated_data_acm.aws_route53_record.integrated_data_cloudfront_acm_validation_record["dev.integrated-data.dft-create-data.com"]: Refreshing state... [id=Z0720763YKRZYOYAPS9Q__870cb64517e799796dad316527841dde.dev.integrated-data.dft-create-data.com._CNAME]
module.integrated_data_acm.aws_route53_record.integrated_data_cloudfront_acm_validation_record["*.dev.integrated-data.dft-create-data.com"]: Refreshing state... [id=Z0720763YKRZYOYAPS9Q__870cb64517e799796dad316527841dde.dev.integrated-data.dft-create-data.com._CNAME]
module.integrated_data_avl_pipeline.module.integrated_data_avl_s3_sqs.aws_cloudwatch_metric_alarm.dlq_new_message_alarm[0]: Refreshing state... [id=integrated-data-avl-dlq-dev-new-message-alarm]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-gtfs-downloader-policy-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-gtfs-region-retriever-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-gtfs-downloader-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-gtfs-region-retriever-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_lambda_permission.integrated_data_mock_avl_producer_api_subscribe_permissions[0]: Refreshing state... [id=terraform-20240621100242940400000010]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_apigatewayv2_integration.integrated_data_avl_mock_producer_api_integration_subscribe[0]: Refreshing state... [id=skr2o7v]
module.integrated_data_vpc_dev.aws_vpc_endpoint_route_table_association.integrated_data_s3_vpc_gateway_endpoint_private_route_table_association["0"]: Refreshing state... [id=a-vpce-05a216de26b9ebb921135958656]
module.integrated_data_vpc_dev.aws_vpc_endpoint_route_table_association.integrated_data_dynamodb_vpc_gateway_endpoint_private_route_table_association["0"]: Refreshing state... [id=a-vpce-0a03ebd25b17414461135958656]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_private_subnet_route_table_assoc["0"]: Refreshing state... [id=rtbassoc-0e22f045ae8df31c0]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_private_subnet_route_table_assoc["2"]: Refreshing state... [id=rtbassoc-090b22d1c17efdac0]
module.integrated_data_vpc_dev.aws_route_table_association.integrated_data_private_subnet_route_table_assoc["1"]: Refreshing state... [id=rtbassoc-0a0a311aa49a1b2b7]
module.integrated_data_avl_data_producer_api.module.avl_validate.module.avl_validate.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-validate-role-dev-20240716105552580500000001]
module.integrated_data_aurora_db_dev.aws_vpc_security_group_egress_rule.integrated_data_db_sg_s3_egress: Refreshing state... [id=sgr-0425faf4202ddbfc1]
module.integrated_data_acm.aws_route53_record.integrated_data_acm_validation_record["*.dev.integrated-data.dft-create-data.com"]: Refreshing state... [id=Z0720763YKRZYOYAPS9Q__870cb64517e799796dad316527841dde.dev.integrated-data.dft-create-data.com._CNAME]
module.integrated_data_acm.aws_route53_record.integrated_data_acm_validation_record["dev.integrated-data.dft-create-data.com"]: Refreshing state... [id=Z0720763YKRZYOYAPS9Q__870cb64517e799796dad316527841dde.dev.integrated-data.dft-create-data.com._CNAME]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-00ac10270fbcb8685]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-00886ed39ef261582]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0fc35cc1e53f6577c]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-06060fe183177c600]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0515b31df2eb617f7]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_security_group.db_sg[0]: Refreshing state... [id=sg-02e20b1ac63322444]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0de78d32e119fa4c7]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-09318dcc986ee105f]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-032cc97a67af67362]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-05b8082b78f789b8b]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-04fee2407dc0d80e7]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0a966ba7bdb4669e4]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0eb571fd7f18ea9db]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0d9fd2e59c10c8b61]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-09fb5e897156647d3]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-097558ebc2ee9c673]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0cfc20759f42a55e1]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0f688df47d9961de3]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-03ed75bb69dc12168]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0a97a3ab988a0caa0]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-00fd2d1e1570f91a4]
module.integrated_data_bastion_host.aws_autoscaling_group.integrated_data_bastion_asg: Refreshing state... [id=integrated-data-bastion-asg-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-noc-processor-role-dev-20240409145851324100000001]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-role-dev-20240523194535513600000001]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-processor-role-dev-20240305190141834700000007]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-db-migrator-rollback-role-dev-20240305190748953700000002]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-tfl-line-id-retriever-role-dev-20240528100153546700000001]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-db-cleardown-role-dev-20240429092504480700000005]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-db-migrator-migrate-role-dev-20240305190748631900000001]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-txc-processor-role-dev-20240311160600130300000001]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-table-renamer-role-dev-20240417085001820600000001]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-gtfs-timetables-generator-role-dev-20240328155130016900000001]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-nptg-uploader-role-dev-20240419083514387100000001]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-gtfs-rt-downloader-2-role-dev-20240510150624697800000001]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-naptan-uploader-role-dev-2024030519014189970000000a]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0053eb8941912ed56]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0339978110412cb8d]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0312ee447ab1e039c]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0ed2928740f8c9d93]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-0b680a57aba8e585c]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-065b931dc571b815d]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-update-endpoint-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-mock-data-producer-send-data-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-subscriber-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-mock-producer-send-heartbeat-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-unsubscriber-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-subscriptions-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-feed-validator-policy-dev]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_downloader_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-gtfs-downloader-role-dev-20240328155154850100000004]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-subscriptions-dev]
module.integrated_data_acm.aws_acm_certificate_validation.integrated_data_cloudfront_acm_validation: Refreshing state... [id=2024-07-03 14:25:29.485 +0000 UTC]
module.integrated_data_gtfs_downloader.module.integrated_data_gtfs_region_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-gtfs-region-retriever-role-dev-20240514080053480900000002]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_apigatewayv2_route.integrated_data_avl_mock_data_producer_api_route_subscribe[0]: Refreshing state... [id=37a7pu0]
module.integrated_data_acm.aws_acm_certificate_validation.integrated_data_acm_validation: Refreshing state... [id=2024-04-30 10:09:12.214 +0000 UTC]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv4[0]: Refreshing state... [id=sgr-0eb59260d5a465d30]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_vpc_security_group_egress_rule.db_sg_allow_all_egress_ipv6[0]: Refreshing state... [id=sgr-015a77942fddb234d]
module.integrated_data_aurora_db_dev.aws_rds_cluster.integrated_data_rds_cluster: Refreshing state... [id=integrated-data-rds-db-cluster-dev]
module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-bods-avl-data-endpoint-role-dev-20240621095910552800000007]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-update-endpoint-role-dev-20240627100148259800000001]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-unsubscriber-role-dev-20240621095912518700000008]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-unsubscriber-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-subscriber-role-dev-20240621095910194400000006]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_iam_role_policy_attachment.lambda_role_lambda_policy_attachment: Refreshing state... [id=integrated-data-avl-siri-vm-downloader-role-dev-20240613134507565700000001]
module.integrated_data_gtfs_rt_pipeline.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-092ebb20aa1a3dd26]
module.integrated_data_avl_pipeline.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0ec8569f9db30eba4]
module.integrated_data_bastion_host.aws_vpc_security_group_ingress_rule.integrated_data_db_sg_allow_bastion_ingress: Refreshing state... [id=sgr-03cfd7741a6843ed5]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-update-endpoint-role-dev-20240627100148276400000002]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-mock-data-producer-send-data-role-dev-2024062109592028600000000c]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-subscriber-role-dev-2024062109591991500000000b]
module.integrated_data_gtfs_api.aws_apigatewayv2_domain_name.integrated_data_gtfs_api_domain: Refreshing state... [id=gtfs.dev.integrated-data.dft-create-data.com]
module.integrated_data_avl_consumer_api.aws_apigatewayv2_domain_name.integrated_data_avl_consumer_api_domain: Refreshing state... [id=avl.dev.integrated-data.dft-create-data.com]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-mock-producer-send-heartbeat-role-dev-2024062109592064980000000d]
module.integrated_data_avl_data_producer_api.module.avl_unsubscriber.module.avl_unsubscriber.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-unsubscriber-role-dev-2024062109591955140000000a]
module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-avl-data-endpoint-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-bods-avl-data-endpoint-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-feed-validator-role-dev-2024062109592102360000000e]
module.integrated_data_avl_data_producer_api.module.avl_subscriptions.module.integrated_data_avl_subscriptions_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-subscriptions-role-dev-20240621095919206700000009]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-06b9a8cd09fa13afc]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-084aa6d8e8eecc6d2]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-018736cf3a884973c]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-07edac8a09d9fc6b3]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-07d3967c9350b40a7]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0fe5277fe0838cc59]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0a75d9ee3ba4bbc16]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-02e48f50f1c275e44]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0ac018faf8660fa8d]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-05bdb55581f96cacb]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0f31372b8dcf02c34]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0550188070b48f09d]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0cb53c23ecd9d432d]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.aws_apigatewayv2_deployment.integrated_data_avl_mock_data_producer_api_deployment[0]: Refreshing state... [id=yshe97]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_domain_name.integrated_data_avl_producer_api_domain: Refreshing state... [id=avl-producer.dev.integrated-data.dft-create-data.com]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_validate: Refreshing state... [id=lyv4hmr]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_validate_permissions: Refreshing state... [id=terraform-20240716105611499800000003]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_vpc_security_group_ingress_rule.db_sg_allow_lambda_ingress[0]: Refreshing state... [id=sgr-0424643d193aa0602]
module.integrated_data_aurora_db_dev.aws_rds_cluster_instance.integrated_data_postgres_db_instance: Refreshing state... [id=integrated-data-rds-db-instance-1-dev]
module.integrated_data_aurora_db_dev.aws_iam_policy.rds_proxy_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-rds-proxy-policy-dev]
module.integrated_data_aurora_db_dev.aws_rds_cluster_role_association.integrated_data_rds_cluster_s3_export_role: Refreshing state... [id=integrated-data-rds-db-cluster-dev,arn:aws:iam::211125357119:role/integrated-data-rds-s3-export-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-bods-avl-data-endpoint-role-dev-2024062109592139880000000f]
module.integrated_data_gtfs_api.aws_apigatewayv2_api_mapping.integrated_data_gtfs_api_domain_mapping: Refreshing state... [id=huvrj5]
module.integrated_data_avl_consumer_api.aws_apigatewayv2_api_mapping.integrated_data_avl_consumer_api_domain_mapping: Refreshing state... [id=4p6sef]
module.integrated_data_gtfs_api.aws_route53_record.integrated_data_gtfs_api_dns_record: Refreshing state... [id=Z0720763YKRZYOYAPS9Q_gtfs.dev.integrated-data.dft-create-data.com_A]
module.integrated_data_gtfs_api.aws_lambda_permission.integrated_data_gtfs_region_retriever_api_permissions: Refreshing state... [id=terraform-20240514080112251300000003]
module.integrated_data_gtfs_api.aws_apigatewayv2_integration.integrated_data_gtfs_timetable_regions_integration: Refreshing state... [id=rk7s8x6]
module.integrated_data_gtfs_api.aws_apigatewayv2_integration.integrated_data_gtfs_downloader_integration: Refreshing state... [id=hjso4ym]
module.integrated_data_gtfs_api.aws_lambda_permission.integrated_data_gtfs_downloader_api_permissions: Refreshing state... [id=terraform-20240507105353402900000006]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_api_mapping.integrated_data_avl_producer_api_domain_mapping: Refreshing state... [id=g4y8n7]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_route53_record.integrated_data_avl_producer_api_dns_record: Refreshing state... [id=Z0720763YKRZYOYAPS9Q_avl-producer.dev.integrated-data.dft-create-data.com_A]
module.integrated_data_aurora_db_dev.aws_iam_role.rds_proxy_role: Refreshing state... [id=integrated-data-rds-proxy-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_validate_api_route: Refreshing state... [id=hx069qo]
module.integrated_data_db_monitoring.aws_cloudwatch_metric_alarm.high_cpu[0]: Refreshing state... [id=integrated-data-db-writer-high-cpu-dev]
module.integrated_data_db_monitoring.aws_cloudwatch_metric_alarm.low_memory[0]: Refreshing state... [id=integrated-data-db-writer-low-memory-dev]
module.integrated_data_avl_pipeline.aws_iam_policy.siri_vm_generator_ecs_task_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-siri-vm-generator-ecs-task-policy-dev]
module.integrated_data_gtfs_rt_pipeline.aws_iam_policy.bods_avl_processor_ecs_task_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-bods-avl-processor-ecs-task-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_subscriptions_permissions: Refreshing state... [id=terraform-20240621100243260600000011]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_subscriptions: Refreshing state... [id=26x5zzh]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-tfl-location-retriever-policy-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-tfl-line-id-retriever-policy-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-processor-policy-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-noc-processor-policy-dev]
module.integrated_data_gtfs_api.aws_apigatewayv2_route.integrated_data_gtfs_timetable_regions_api_route: Refreshing state... [id=y04ye6m]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-gtfs-rt-downloader-2-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-gtfs-timetables-generator-policy-dev]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-txc-processor-policy-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-db-migrator-migrate-policy-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-db-migrator-rollback-policy-dev]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-db-cleardown-policy-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-nptg-uploader-policy-dev]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-table-renamer-policy-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-naptan-uploader-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_unsubscribe: Refreshing state... [id=jskanue]
module.integrated_data_gtfs_api.aws_apigatewayv2_route.integrated_data_gtfs_api_route: Refreshing state... [id=015grlh]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_unsubscribe_permissions: Refreshing state... [id=terraform-20240621100243847300000013]
module.integrated_data_aurora_db_dev.aws_db_proxy.integrated_data_rds_proxy: Refreshing state... [id=integrated-data-rds-proxy-dev]
module.integrated_data_avl_pipeline.aws_iam_role.siri_vm_generator_ecs_task_role[0]: Refreshing state... [id=integrated-data-siri-vm-generator-ecs-task-role-dev]
module.integrated_data_gtfs_rt_pipeline.aws_iam_role.bods_avl_processor_ecs_task_role[0]: Refreshing state... [id=integrated-data-bods-avl-processor-ecs-task-role-dev]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_iam_policy.lambda_policy[0]: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-siri-vm-downloader-policy-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-tfl-line-id-retriever-role-dev-20240528100153851400000002]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-role-dev-20240523160706475700000004]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-processor-role-dev-20240305190141876300000008]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-noc-processor-role-dev-20240409145851328900000002]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_subscriptions_api_route: Refreshing state... [id=vfzi0pp]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_subscription_api_route: Refreshing state... [id=eejzgi7]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-gtfs-rt-downloader-2-role-dev-20240510150625029100000002]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-txc-processor-role-dev-20240311160600134700000002]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_data_permissions: Refreshing state... [id=terraform-20240621100243563500000012]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_data: Refreshing state... [id=xf0zclk]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-db-cleardown-role-dev-20240429092512042800000008]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-gtfs-timetables-generator-role-dev-20240328155141279800000002]
module.integrated_data_avl_data_producer_api.module.avl_update_endpoint.module.avl_update_endpoint.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-update-endpoint-dev]
module.integrated_data_avl_data_producer_api.module.avl_subscriber.module.avl_subscriber.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-subscriber-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-db-migrator-rollback-role-dev-20240305190749249900000003]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-db-migrator-migrate-role-dev-20240305190749419500000004]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-table-renamer-role-dev-20240417085001824500000002]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-nptg-uploader-role-dev-20240419083519062600000002]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-naptan-uploader-role-dev-2024030519014203740000000b]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_api_route_unsubscribe: Refreshing state... [id=rd6pzk4]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_iam_role_policy_attachment.lambda_role_custom_policy_attachment[0]: Refreshing state... [id=integrated-data-avl-siri-vm-downloader-role-dev-20240528090719036100000001]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-mock-producer-send-heartbeat-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-mock-data-producer-send-data-dev]
module.integrated_data_aurora_db_dev.aws_db_proxy_default_target_group.integrated_data_rds_proxy_default_target_group: Refreshing state... [id=integrated-data-rds-proxy-dev]
module.integrated_data_aurora_db_dev.aws_route53_record.integrated_data_db_reader_cname_record: Refreshing state... [id=Z08492942LI9YDSUKYBS9_db.reader.bods-integrated-data.internal_CNAME]
module.integrated_data_aurora_db_dev.aws_route53_record.integrated_data_db_cname_record: Refreshing state... [id=Z08492942LI9YDSUKYBS9_db.bods-integrated-data.internal_CNAME]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_api_route_data: Refreshing state... [id=h5m9sai]
module.integrated_data_txc_pipeline.module.integrated_data_txc_processor_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-txc-processor-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-tfl-line-id-retriever-dev]
module.integrated_data_txc_pipeline.module.integrated_data_gtfs_timetables_generator_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-gtfs-timetables-generator-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_processor_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-processor-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_location_retriever_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-dev]
module.integrated_data_naptan_pipeline.module.integrated_data_naptan_uploader_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-naptan-uploader-dev]
module.integrated_data_noc_pipeline.module.integrated_data_noc_processor_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-noc-processor-dev]
module.integrated_data_db_cleardown_function.module.integrated_data_db_cleardown_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-db-cleardown-dev]
module.integrated_data_table_renamer.module.integrated_data_table_renamer_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-table-renamer-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_rollback_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-db-migrator-rollback-dev]
module.integrated_data_nptg_pipeline.module.integrated_data_nptg_uploader_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-nptg-uploader-dev]
module.integrated_data_db_migrator.module.integrated_data_db_migrator_migrate_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-db-migrator-migrate-dev]
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-siri-vm-downloader-dev]
module.integrated_data_aurora_db_dev.aws_db_proxy_target.integrated_data_rds_proxy_target: Refreshing state... [id=integrated-data-rds-proxy-dev/default/TRACKED_CLUSTER/integrated-data-rds-db-cluster-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_cloudwatch_event_rule.schedule[0]: Refreshing state... [id=schedule-integrated-data-avl-mock-producer-send-heartbeat-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_cloudwatch_event_rule.schedule[0]: Refreshing state... [id=schedule-integrated-data-avl-mock-data-producer-send-data-dev]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_cloudwatch_event_rule.schedule[0]: Refreshing state... [id=schedule-integrated-data-avl-tfl-line-id-retriever-dev]
module.integrated_data_avl_pipeline.aws_lambda_event_source_mapping.integrated_data_avl_processor_sqs_trigger: Refreshing state... [id=31edd687-e010-4e6a-b5f0-29618ca46d4c]
module.integrated_data_gtfs_rt_pipeline.aws_ecs_task_definition.bods_avl_processor_task_definition[0]: Refreshing state... [id=integrated-data-bods-avl-processor]
module.integrated_data_avl_pipeline.aws_ecs_task_definition.siri_vm_generator_task_definition[0]: Refreshing state... [id=integrated-data-siri-vm-generator]
module.integrated_data_gtfs_rt_pipeline.module.integrated_data_gtfs_rt_downloader_function.aws_lambda_function.function: Refreshing state... [id=integrated-data-gtfs-rt-downloader-2-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_subscribe: Refreshing state... [id=shv3025]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_subscribe_permissions: Refreshing state... [id=terraform-20240621100341734000000014]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_lambda_permission.integrated_data_avl_producer_api_update_permissions: Refreshing state... [id=terraform-20240627100202950000000003]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_integration.integrated_data_avl_producer_api_integration_update: Refreshing state... [id=irc596h]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator.module.avl_feed_validator.aws_lambda_function.function: Refreshing state... [id=integrated-data-avl-feed-validator-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].data.aws_region.current: Reading...
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].data.aws_caller_identity.current: Reading...
module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.aws_lambda_function_url.avl_siri_vm_downloader_function_url: Refreshing state... [id=integrated-data-avl-siri-vm-downloader-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_api_route_subscribe: Refreshing state... [id=7e9z8qi]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_role.sfn_event_bridge_role: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-sfn-eb-role-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_lambda_permission.allow_events_bridge_to_run_lambda[0]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_heartbeat.aws_cloudwatch_event_target.schedule_lambda[0]: Refreshing state... [id=schedule-integrated-data-avl-mock-producer-send-heartbeat-dev-terraform-20240621100352241800000016]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_route.integrated_data_avl_producer_api_route_update: Refreshing state... [id=f63pw45]
module.integrated_data_gtfs_rt_pipeline.aws_ecs_service.bods_avl_processor_service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-2:211125357119:service/integrated-data-gtfs-rt-ecs-cluster-dev/integrated-data-bods-avl-processor-service-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_role.integrated_data_lambda_trigger_sfn_role: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-sfn-role-dev]
module.integrated_data_timetables_sfn.aws_sfn_state_machine.integrated_data_timetables_sfn: Refreshing state... [id=arn:aws:states:eu-west-2:211125357119:stateMachine:integrated-data-timetables-sfn-dev]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_cloudwatch_event_target.schedule_lambda[0]: Refreshing state... [id=schedule-integrated-data-avl-mock-data-producer-send-data-dev-terraform-20240621100346409900000015]
module.integrated_data_avl_data_producer_api.module.avl_mock_data_producer.module.integrated_data_avl_mock_data_producer_send_data.aws_lambda_permission.allow_events_bridge_to_run_lambda[0]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_lambda_permission.allow_events_bridge_to_run_lambda[0]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.integrated_data_avl_pipeline.module.integrated_data_avl_tfl_line_id_retriever_function.aws_cloudwatch_event_target.schedule_lambda[0]: Refreshing state... [id=schedule-integrated-data-avl-tfl-line-id-retriever-dev-terraform-20240527195708226300000001]
module.integrated_data_avl_pipeline.aws_ecs_service.siri_vm_generator_service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-2:211125357119:service/integrated-data-siri-vm-generator-ecs-cluster-dev/integrated-data-siri-vm-generator-service-dev]
module.integrated_data_avl_data_producer_api.module.avl_producer_api_gateway[0].aws_apigatewayv2_deployment.integrated_data_avl_producer_api_deployment: Refreshing state... [id=ozzssx]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_sfn_state_machine.integrated_data_lambda_trigger_sfn: Refreshing state... [id=arn:aws:states:eu-west-2:211125357119:stateMachine:integrated-data-avl-tfl-location-retriever-sfn-dev]
module.integrated_data_gtfs_api.aws_lambda_permission.integrated_data_gtfs_rt_downloader_api_permissions: Refreshing state... [id=terraform-20240510150844577100000003]
module.integrated_data_gtfs_api.aws_apigatewayv2_integration.integrated_data_gtfs_rt_downloader_integration: Refreshing state... [id=znef4c4]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].data.aws_region.current: Reading...
module.integrated_data_cloudfront.aws_cloudfront_distribution.avl_siri_vm_distribution: Refreshing state... [id=E2388RFF83MXBP]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].data.aws_caller_identity.current: Reading...
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_role.sfn_event_bridge_role: Refreshing state... [id=integrated-data-avl-feed-validator-sfn-eb-role-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].data.aws_caller_identity.current: Read complete after 0s [id=211125357119]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_role.integrated_data_lambda_trigger_sfn_role: Refreshing state... [id=integrated-data-avl-feed-validator-sfn-role-dev]
module.integrated_data_gtfs_api.aws_apigatewayv2_route.integrated_data_gtfs_rt_api_route: Refreshing state... [id=pxp5xtg]
module.integrated_data_cloudfront.aws_lambda_permission.avl_siri_vm_downloader_invoke: Refreshing state... [id=AllowCloudFrontServicePrincipal]
module.integrated_data_cloudfront.aws_route53_record.integrated_data_avl_consumer_api_dns_record: Refreshing state... [id=Z0720763YKRZYOYAPS9Q_avl.dev.integrated-data.dft-create-data.com_A]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_sfn_state_machine.integrated_data_lambda_trigger_sfn: Refreshing state... [id=arn:aws:states:eu-west-2:211125357119:stateMachine:integrated-data-avl-feed-validator-sfn-dev]
module.integrated_data_gtfs_api.aws_apigatewayv2_deployment.integrated_data_gtfs_api_deployment: Refreshing state... [id=icx8op]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_cloudwatch_event_rule.lambda_trigger_sfn_schedule: Refreshing state... [id=schedule-integrated-data-avl-tfl-location-retriever-sfn-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_policy.allow_event_bridge_to_run_sfn_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-tfl-location-retriever-sfn-eb-policy-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_policy.integrated_data_lambda_trigger_sfn_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-tfl-location-retriever-sfn-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_policy.integrated_data_lambda_trigger_sfn_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-feed-validator-sfn-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_policy.allow_event_bridge_to_run_sfn_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-avl-feed-validator-sfn-eb-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_cloudwatch_event_rule.lambda_trigger_sfn_schedule: Refreshing state... [id=schedule-integrated-data-avl-feed-validator-sfn-dev]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_role_policy_attachment.sfn_eventbridge_policy_attachment: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-sfn-eb-role-dev-2024052313564432850000000a]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_iam_role_policy_attachment.integrated_data_lambda_trigger_sfn_policy_attachment: Refreshing state... [id=integrated-data-avl-tfl-location-retriever-sfn-role-dev-20240523160735018500000007]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_role_policy_attachment.sfn_eventbridge_policy_attachment: Refreshing state... [id=integrated-data-avl-feed-validator-sfn-eb-role-dev-20240621100359809900000019]
module.integrated_data_timetables_sfn.aws_iam_policy.integrated_data_timetables_sfn_policy: Refreshing state... [id=arn:aws:iam::211125357119:policy/integrated-data-timetables-sfn-policy-dev]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_iam_role_policy_attachment.integrated_data_lambda_trigger_sfn_policy_attachment: Refreshing state... [id=integrated-data-avl-feed-validator-sfn-role-dev-20240621100359713200000018]
module.integrated_data_avl_pipeline.module.avl_tfl_location_retriever_sfn[0].aws_cloudwatch_event_target.schedule_lambda_trigger_sfn: Refreshing state... [id=schedule-integrated-data-avl-tfl-location-retriever-sfn-dev-terraform-20240523160734644600000006]
module.integrated_data_avl_data_producer_api.module.avl_feed_validator_sfn[0].aws_cloudwatch_event_target.schedule_lambda_trigger_sfn: Refreshing state... [id=schedule-integrated-data-avl-feed-validator-sfn-dev-terraform-20240621100359254100000017]
module.integrated_data_timetables_sfn.aws_iam_role_policy_attachment.integrated_data_timetables_sfn_policy_attachment: Refreshing state... [id=integrated-data-timetables-sfn-role-dev-2024042909290922930000000b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.integrated_data_internal_api.aws_lambda_permission.internal_api_siri_vm_downloader_alb_tg_permissions will be created
  + resource "aws_lambda_permission" "internal_api_siri_vm_downloader_alb_tg_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "integrated-data-avl-siri-vm-downloader-dev"
      + id                  = (known after apply)
      + principal           = "elasticloadbalancing.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromLb"
      + statement_id_prefix = (known after apply)
    }

  # module.integrated_data_internal_api.aws_lb.internal_api_alb will be created
  + resource "aws_lb" "internal_api_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "api-internal-alb-dev"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0086238f6dd09c42e",
          + "subnet-0653d66c37f1fae4c",
          + "subnet-0957d8d504826c2fd",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.integrated_data_internal_api.aws_lb.internal_api_nlb will be created
  + resource "aws_lb" "internal_api_nlb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = false
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = "api-internal-nlb-dev"
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0086238f6dd09c42e",
          + "subnet-0653d66c37f1fae4c",
          + "subnet-0957d8d504826c2fd",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)
    }

  # module.integrated_data_internal_api.aws_lb_listener.internal_api_alb_listener will be created
  + resource "aws_lb_listener" "internal_api_alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.integrated_data_internal_api.aws_lb_listener.internal_api_nlb_listener will be created
  + resource "aws_lb_listener" "internal_api_nlb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.integrated_data_internal_api.aws_lb_target_group.internal_api_alb_tg will be created
  + resource "aws_lb_target_group" "internal_api_alb_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "internal-api-alb-tg-dev"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "lambda"

      + health_check {
          + enabled             = false
          + healthy_threshold   = 3
          + interval            = 60
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.integrated_data_internal_api.aws_lb_target_group.internal_api_nlb_tg will be created
  + resource "aws_lb_target_group" "internal_api_nlb_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "internal-api-nlb-tg-dev"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "alb"
      + vpc_id                             = "vpc-05214265b6f4e3e89"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 120
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.integrated_data_internal_api.aws_lb_target_group_attachment.internal_api_alb_tg_attachment will be created
  + resource "aws_lb_target_group_attachment" "internal_api_alb_tg_attachment" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "arn:aws:lambda:eu-west-2:211125357119:function:integrated-data-avl-siri-vm-downloader-dev"
    }

  # module.integrated_data_internal_api.aws_lb_target_group_attachment.internal_api_nlb_tg_attachment will be created
  + resource "aws_lb_target_group_attachment" "internal_api_nlb_tg_attachment" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.integrated_data_internal_api.aws_security_group.internal_api_alb_sg will be created
  + resource "aws_security_group" "internal_api_alb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "integrated-data-internal-api-alb-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05214265b6f4e3e89"
    }

  # module.integrated_data_internal_api.aws_security_group.internal_api_nlb_sg will be created
  + resource "aws_security_group" "internal_api_nlb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "integrated-data-internal-api-nlb-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05214265b6f4e3e89"
    }

  # module.integrated_data_internal_api.aws_vpc_endpoint_service.vpc_endpoint_service will be created
  + resource "aws_vpc_endpoint_service" "vpc_endpoint_service" {
      + acceptance_required            = true
      + allowed_principals             = (sensitive value)
      + arn                            = (known after apply)
      + availability_zones             = (known after apply)
      + base_endpoint_dns_names        = (known after apply)
      + id                             = (known after apply)
      + manages_vpc_endpoints          = (known after apply)
      + network_load_balancer_arns     = (known after apply)
      + private_dns_name               = (known after apply)
      + private_dns_name_configuration = (known after apply)
      + service_name                   = (known after apply)
      + service_type                   = (known after apply)
      + state                          = (known after apply)
      + supported_ip_address_types     = [
          + "ipv4",
        ]
      + tags_all                       = (known after apply)
    }

  # module.integrated_data_internal_api.aws_vpc_security_group_egress_rule.internal_api_alb_sg_all_egress_ipv4 will be created
  + resource "aws_vpc_security_group_egress_rule" "internal_api_alb_sg_all_egress_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.integrated_data_internal_api.aws_vpc_security_group_egress_rule.internal_api_nlb_sg_alb_egress_ipv4 will be created
  + resource "aws_vpc_security_group_egress_rule" "internal_api_nlb_sg_alb_egress_ipv4" {
      + arn                          = (known after apply)
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.integrated_data_internal_api.aws_vpc_security_group_ingress_rule.internal_api_alb_sg_nlb_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "internal_api_alb_sg_nlb_ingress" {
      + arn                          = (known after apply)
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.integrated_data_internal_api.aws_vpc_security_group_ingress_rule.internal_api_nlb_sg_vpn_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "internal_api_nlb_sg_vpn_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = (sensitive value)
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.integrated_data_avl_consumer_api.module.integrated_data_avl_siri_vm_downloader.module.integrated_data_avl_siri_vm_downloader_function.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "integrated-data-avl-siri-vm-downloader-dev"
      ~ last_modified                  = "2024-07-26T10:45:54.625+0000" -> (known after apply)
      ~ source_code_hash               = "Uf62DmAHie8WOYXMEROHrCrgjJ7oePv0GUDn0OQ9ofk=" -> "Ib1flxnvYz++W6NV8UH5hyd2W/OH+KCMrXpT9qq4yPg="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.integrated_data_avl_data_producer_api.module.avl_data_endpoint.module.integrated_data_bods_avl_data_endpoint_function.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "integrated-data-bods-avl-data-endpoint-dev"
      ~ last_modified                  = "2024-07-23T12:33:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "+6cqYd3BJ7BtSdrGSMVD2BVMiQUS6DKloBhnJr5aeHI=" -> "YPfHi5U6ESf68xnMdUAqR7qLXUkXg8toA+7FIcWllIQ="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 16 to add, 2 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../modules/shared/lambda-function/main.tf line 14, in locals:
  14:   data.aws_lambda_function.existing_function[0].source_code_hash)

The attribute "source_code_hash" is deprecated. Refer to the provider
documentation for details.

(and 71 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ljones92, Action: `pull_request`, Workflow: `Terraform Plan`*